/*
Меги си намислила цяло положително число n и редица, която се състои от малки латински букви.
Помогнете на Меги да намери най-дългата подредица, която да е такава, че измежду нейните елементи поне веднъж да се среща само една от първите n букви на латинската азбука.

Input Format

От първия ред на стандартния вход се въвежда едно цяло число n.
От втория ред се въвежда дадената редица, съставена от малки латински букви.

Constraints

0 < n < 26
0 < Брой символи в дадената редица ≤ 1 000 000

Output Format

На първия ред на стандартния изход програмата трябва да изведе дължината на търсената подредица.
На втория ред на стандартния изход програмата трябва да изведе търсената подредица. Ако има няколко подредици, които отговарят на поставеното условие, програмата трябва да изведе подредицата, чийто първи елемент е с най-малък индекс в дадената първоначална редица.
Ако няма подредица, която да отговаря на условието, програмата извежда само един ред, съдържащ числото 0.

Sample Input 0

3
abgsacdafwasb
Sample Output 0

6
dafwas
 */

int n = int.Parse(Console.ReadLine());
string r = Console.ReadLine();
