/*
В час по информационни технологии Петър и Георги се опитали да измислят нова игра. Петър нарисувал таблица с размери A x B. Първоначално всички клетки в таблицата са празни. На всеки ход играчът, който е на ред, избира ред или колона, който съдържа поне една празна клетка, и оцветява всички празни клетки в избрания ред или колона. Победата е за този играч, който оцвети последната празна клетка.
Петър и Георги искали да напишат програма, която определя, кой от играчите ще победи, ако и двамата правят винаги най-добрите (печеливши) възможни ходове. Ако победата е за първия играч, да се намери и броя на различните възможности за неговия първи ход, така че със сигурност той да победи.

Input Format

От първия ред на стандартния вход се въвеждат две цели положителни числа A и B (размери на таблицата). Числата са разделени с един интервал.

Constraints

1 ≤ A , B ≤ 106

Output Format

На първия ред на стандартния изход се извежда числото 1, ако първият играч (този, който започва играта) е победител или числото 2, ако вторият играч е победител. Ако победата е за първия играч, то на втория ред програмата извежда едно цяло число – броя на различните възможности за неговия първи ход, така че със сигурност той да победи.

Sample Input 0

2 2
Sample Output 0

2
 */

class Solution
{
    static void Main(String[] args)
    {
        int[] rowsAndCols = Console.ReadLine().Split(" ").Select(int.Parse).ToArray();

        int rows = rowsAndCols[0];
        int cols = rowsAndCols[1];

        int[,] matrix = new int[rows, cols];


    }
}